Tekla Open API Reference for Tekla Structures 2025
PluginBase.Run Method
 The main method of the plug-in. It is called after the input has been defined with DefineInput(). This is the "main" method of the plug-in and should contain all the actual implementation.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract bool Run(
	List<PluginBase.InputDefinition> Input
)
Public MustOverride Function Run (
	Input As List(Of PluginBase.InputDefinition)
) As Boolean
Parameters
Input
Type: System.Collections.Generic.List<PluginBase.InputDefinition>
A list of the same format and order as what was returned from DefineInput().
Return Value
Type: Boolean
True on success.
See Also
Reference
PluginBase Class
Tekla.Structures.Plugins Namespace